<script setup lang="ts">
import type { Choice } from './Quiz.vue'
import YellowCard from './YellowCard.vue'
import AnswerSummaryCard from './AnswerSummaryCard.vue'

interface Question {
  id: number
  text: string
  choices: { id: Choice; text: string }[]
  answer: Choice
  explanation?: string
}
interface QuizResultHistory {
  question: Question
  userAnswer: Choice | null
}

const props = defineProps<{
  score: number
  history: QuizResultHistory[]
}>()

const emit = defineEmits<{
  (e: 'restart'): void
}>()

const showPopup = ref(false)

const allScoreDisplayData: {
  score: number
  head: string
  text_1: string
  text_2?: string
}[] = [
  {
    score: 0,
    head: 'คุณพร้อม… ทำอะไรนะ?',
    text_1:
      'บูส ๆ หน่อย! เพราะเลือกตั้ง อบต. ก็สำคัญไม่แพ้เลือกตั้งไหน ๆ ยังไม่สายเกินไปที่จะเตรียมตัว ',
    text_2: 'ควิซนี้ถือเป็นน้ำจิ้ม แล้ววันเข้าคูหา ขอให้พร้อมที่สุดนะ! 🍀',
  },
  {
    score: 1,
    head: 'คุณพร้อม… ทำอะไรนะ?',
    text_1:
      'บูส ๆ หน่อย! เพราะเลือกตั้ง อบต. ก็สำคัญไม่แพ้เลือกตั้งไหน ๆ ยังไม่สายเกินไปที่จะเตรียมตัว ',
    text_2: 'ควิซนี้ถือเป็นน้ำจิ้ม แล้ววันเข้าคูหา ขอให้พร้อมที่สุดนะ! 🍀',
  },
  {
    score: 2,
    head: 'คุณพร้อม… ทำอะไรนะ?',
    text_1:
      'บูส ๆ หน่อย! เพราะเลือกตั้ง อบต. ก็สำคัญไม่แพ้เลือกตั้งไหน ๆ ยังไม่สายเกินไปที่จะเตรียมตัว ',
    text_2: 'ควิซนี้ถือเป็นน้ำจิ้ม แล้ววันเข้าคูหา ขอให้พร้อมที่สุดนะ! 🍀',
  },
  {
    score: 3,
    head: 'คุณพร้อมน้อยไปหน่อย!',
    text_1: 'อาจจะยังนะตอนนี้… แต่เวลายังมีให้คุณได้เตรียมพร้อมและเข้าคูหาแบบมั่นใจ ไม่กลัว!',
    text_2: 'ลองทบทวนคำตอบอีกสักหน่อย แล้วมาเก็บเต็มก่อนวันเลือกตั้งนะ 🏃‍♀️💨',
  },
  {
    score: 4,
    head: 'คุณพร้อมน้อยไปหน่อย!',
    text_1: 'อาจจะยังนะตอนนี้… แต่เวลายังมีให้คุณได้เตรียมพร้อมและเข้าคูหาแบบมั่นใจ ไม่กลัว!',
    text_2: 'ลองทบทวนคำตอบอีกสักหน่อย แล้วมาเก็บเต็มก่อนวันเลือกตั้งนะ 🏃‍♀️💨',
  },
  {
    score: 5,
    head: 'คุณพร้อมน้อยไปหน่อย!',
    text_1: 'อาจจะยังนะตอนนี้… แต่เวลายังมีให้คุณได้เตรียมพร้อมและเข้าคูหาแบบมั่นใจ ไม่กลัว!',
    text_2: 'ลองทบทวนคำตอบอีกสักหน่อย แล้วมาเก็บเต็มก่อนวันเลือกตั้งนะ 🏃‍♀️💨',
  },
  {
    score: 6,
    head: 'คุณพร้อมแบบกั๊ก ๆ!',
    text_1: 'ทรงดี มาขนาดนี้แล้วก็ไปต่อจนกว่าจะพร้อมแบบเต็มพิกัด!',
    text_2: 'ลองทบทวนคำตอบอีกสักหน่อย แล้วมาเก็บเต็มก่อนวันเลือกตั้งนะ 🔥',
  },
  {
    score: 7,
    head: 'คุณพร้อมแบบกั๊ก ๆ!',
    text_1: 'ทรงดี มาขนาดนี้แล้วก็ไปต่อจนกว่าจะพร้อมแบบเต็มพิกัด!',
    text_2: 'ลองทบทวนคำตอบอีกสักหน่อย แล้วมาเก็บเต็มก่อนวันเลือกตั้งนะ 🔥',
  },
  {
    score: 8,
    head: 'คุณพร้อมไม่เบา!',
    text_1: 'จัดว่าเตรียมตัวได้เยี่ยมยอด อีกนิดเดียวก็จะพร้อมแบบเต็มร้อย!',
    text_2: 'ลองทบทวนคำตอบอีกสักหน่อย แล้วมาเก็บเต็มก่อนวันเลือกตั้งนะ 👏',
  },
  {
    score: 9,
    head: 'คุณพร้อม 99.99999%',
    text_1: 'จัดว่าเตรียมตัวได้เยี่ยมยอด อีกนิดเดียวก็จะพร้อมแบบเต็มร้อย!',
    text_2: 'ลองทบทวนคำตอบอีกสักหน่อย แล้วมาเก็บเต็มก่อนวันเลือกตั้งนะ 🚀',
  },
  {
    score: 10,
    head: 'คุณพร้อมแบบตะโกน!!!',
    text_1:
      'สุดยอด ดีเลิศ มหัศจรรย์ อันดับหนึ่ง! พร้อมขนาดนี้ก็ไม่มีอะไรต้องห่วง อย่าลืมคงความพร้อมแบบนี้ไว้จนถึงวันเข้าคูหานะ 💖',
  },
]

const currentResult = computed(() => {
  const found = allScoreDisplayData.find((item) => item.score === props.score)
  return found ?? allScoreDisplayData[0]
})

const gifSource = computed(() => {
  const formattedScore = props.score.toString().padStart(2, '0')

  return `/gif/check_${formattedScore}.gif`
})
</script>

<template>
  <div class="flex min-h-screen flex-col items-center justify-center px-6 pt-10 text-center">
    <div class="relative">
      <h6
        class="font-sriracha absolute top-1/2 left-1/2 -translate-x-1/2 -translate-y-1/2 text-[32px]"
      >
        {{ score }}/10
      </h6>
      <div class="h-20 w-20 flex-none md:h-[120px] md:w-[120px]">
        <img class="h-full w-full" src="/assets/images/yellow-circle.svg" alt="" />
      </div>
    </div>
    <div class="w-[180px] pt-2 pb-4 md:w-[220px]">
      <img :src="gifSource" alt="Score Result GIF" />
    </div>
    <h6 class="text-blue-01 mb-1 font-bold">{{ currentResult?.head }}</h6>
    <div class="flex w-[250px] flex-col gap-2 md:w-[700px]">
      <p class="b5 font-medium">
        {{ currentResult?.text_1 }}
      </p>
      <p class="b5 font-medium">{{ currentResult?.text_2 }}</p>
    </div>
    <div class="gap-0.5 pt-4 pb-5.5">
      <p class="b5 text-blue-01 font-bold">แชร์ผลลัพธ์ที่ได้</p>
    </div>
    <div class="flex w-full flex-col items-center gap-2 md:flex-row md:justify-center">
      <button
        @click="$emit('restart')"
        class="bg-blue-06 hover:bg-blue-05 border-blue-06 hover:border-blue-05 flex w-full max-w-[280px] cursor-pointer items-center justify-center gap-2.5 rounded-lg border-2 py-[11px] font-bold"
      >
        <img src="/assets/images/replay.svg" alt="" />
        <p class="h11 translate-y-0.5">เล่นใหม่</p>
      </button>
      <button
        @click="showPopup = true"
        class="hover:bg-blue-05 hover:border-blue-05 flex w-full max-w-[280px] cursor-pointer items-center justify-center gap-2.5 rounded-lg border-2 py-[11px] font-bold"
      >
        <img src="/assets/images/result.svg" alt="" />

        <p class="h11 translate-y-0.5">ทวนเฉลยอีกรอบ</p>
      </button>
    </div>
    <YellowCard />

    <div v-if="showPopup" class="bg-blue-03 fixed inset-0 z-50 flex flex-col overflow-y-auto">
      <div class="sticky top-0 flex justify-end p-3 md:px-6">
        <button
          @click="showPopup = false"
          class="cursor-pointer p-1 transition-opacity hover:opacity-80"
        >
          <img src="/assets/images/close.svg" alt="Close" />
        </button>
      </div>

      <div class="flex-1 px-4 pb-8 md:px-6">
        <div class="mx-auto flex flex-col gap-8">
          <AnswerSummaryCard
            v-for="(item, index) in history"
            :key="item.question.id"
            :index="index"
            :question="item.question"
            :userAnswer="item.userAnswer"
            explanation=""
          />
        </div>
      </div>
    </div>
  </div>
</template>
